3A/SE350/Multiprocessor-Multicore-Realtime-Scheduling.org
#+title: Multiprocessor, Multicore, and Realtime Scheduling
#+author: Arnav Gupta
#+LATEX_HEADER: \usepackage{parskip,darkmode}
#+LATEX_HEADER: \enabledarkmode

* Multiprocessor and Multicore Scheduling
Multiprocessor systems can be classified as:
- *loosely coupled or distributed multiprocessor or cluster*: has collection of relatively
  autonomous systems, each processor having its own main memory and IO channels
- *functionaly specialized processors*: controlled by the master processor and provide services
  to it
- *tightly coupled multiprocessor*: has set of processors that share a common main memory and
  are under the integrated control of an OS

** Granularity
Multiprocessors can be categorized and placed in context with other architectures by
considering *synchronization granularity* or frequency between processes in a system.

Grain categories are:
- *fine*: parallelism inherent in a single instruction stream, interval <20 instructions
- *medium*: parallel processing or multitasking within a single application, interval
  20-200 instructions
- *coarse*: multiprocessing of concurrent ptocesses in a multiprogramming environment,
  interval 200-2000 instructions
- *very coarse*: distributed processing across network nodes to form a single computing
  environment, interval 2000-1 million instructions
- *independent*: multiple unrelated processes, interval not applicable

*** Independent Parallelism
No explicit synchronization between processes, each represents a separate job.
Example is time-sharing system.
Works similar to multiprogrammed uniprocessor with shorter average response time.

*** Coarse and Very Coarse-Grained Parallelism
Only high-level synchronization among processes so can work as concurrent processes
running on a multiprogrammed uniprocessor, so not much user code change.

Any collection of concurrent processes that need to communicate or synchronize can
benefit from multiprocessor use.
If infrequent process interaction, a distributed system could provide support,
if frequent, then overhead of network communication negates some speedup.

*** Medium-Grained Parallelism
If an application is a collection of threads in a process, the programmer must
specify potential parallelism.
Typically, much coordination and interaction among the threads of an application.

Since application threads interact frequently, scheduling decisions concerning 1
thread may affect application performance.

*** Fine-Grained Parallelism
More complex use of parallelism found in the use of threads.
Specialized and fragmented area.

** Design Issues
3 interrelated issues for multiprocessor scheduling:
1. assignment of processes to processors
2. use of multiprogramming on individual processors
3. actual dispatching a process

