3A/SE350/Multiprocessor-Multicore-Realtime-Scheduling.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-26 Tue 20:29 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Multiprocessor, Multicore, and Realtime Scheduling</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Multiprocessor, Multicore, and Realtime Scheduling</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org6c0363a">1. Multiprocessor and Multicore Scheduling</a>
<ul>
<li><a href="#orgbc35edb">1.1. Granularity</a>
<ul>
<li><a href="#org5264eba">1.1.1. Independent Parallelism</a></li>
<li><a href="#orgcbb9dce">1.1.2. Coarse and Very Coarse-Grained Parallelism</a></li>
<li><a href="#org7017e5d">1.1.3. Medium-Grained Parallelism</a></li>
<li><a href="#org0b407e4">1.1.4. Fine-Grained Parallelism</a></li>
</ul>
</li>
<li><a href="#org3d1bfa8">1.2. Design Issues</a>
<ul>
<li><a href="#orgf029829">1.2.1. Assignment of Processes to Processors</a></li>
<li><a href="#orgfff7acc">1.2.2. Use of Multiprogramming on Individual Processes</a></li>
<li><a href="#orgb26d220">1.2.3. Process Dispatching</a></li>
</ul>
</li>
<li><a href="#org8d42be4">1.3. Process Scheduling</a></li>
<li><a href="#orge79e41a">1.4. Thread Scheduling</a>
<ul>
<li><a href="#org9b26996">1.4.1. Load Sharing</a></li>
<li><a href="#org19c5e3b">1.4.2. Gang Scheduling</a></li>
<li><a href="#orga705d20">1.4.3. Dedicated Processor Assignment</a></li>
<li><a href="#orgbfe8b3c">1.4.4. Dynamic Scheduling</a></li>
</ul>
</li>
<li><a href="#orge43b6b8">1.5. Multicore Thread Scheduling</a></li>
</ul>
</li>
<li><a href="#org7d4910d">2. Real-Time Scheduling</a>
<ul>
<li><a href="#org049ddf8">2.1. Background</a></li>
<li><a href="#org974bab4">2.2. Characteristics of Real-Time Operating Systems</a></li>
<li><a href="#orgf0bd5e3">2.3. Real-Time Scheduling</a></li>
<li><a href="#org95a3100">2.4. Deadline Scheduling</a></li>
<li><a href="#orgc22aa4f">2.5. Rate Monotonic Scheduling</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org6c0363a" class="outline-2">
<h2 id="org6c0363a"><span class="section-number-2">1.</span> Multiprocessor and Multicore Scheduling</h2>
<div class="outline-text-2" id="text-1">
<p>
Multiprocessor systems can be classified as:
</p>
<ul class="org-ul">
<li><b>loosely coupled or distributed multiprocessor or cluster</b>: has collection of relatively
autonomous systems, each processor having its own main memory and IO channels</li>
<li><b>functionaly specialized processors</b>: controlled by the master processor and provide services
to it</li>
<li><b>tightly coupled multiprocessor</b>: has set of processors that share a common main memory and
are under the integrated control of an OS</li>
</ul>
</div>
<div id="outline-container-orgbc35edb" class="outline-3">
<h3 id="orgbc35edb"><span class="section-number-3">1.1.</span> Granularity</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Multiprocessors can be categorized and placed in context with other architectures by
considering <b>synchronization granularity</b> or frequency between processes in a system.
</p>

<p>
Grain categories are:
</p>
<ul class="org-ul">
<li><b>fine</b>: parallelism inherent in a single instruction stream, interval &lt;20 instructions</li>
<li><b>medium</b>: parallel processing or multitasking within a single application, interval
20-200 instructions</li>
<li><b>coarse</b>: multiprocessing of concurrent ptocesses in a multiprogramming environment,
interval 200-2000 instructions</li>
<li><b>very coarse</b>: distributed processing across network nodes to form a single computing
environment, interval 2000-1 million instructions</li>
<li><b>independent</b>: multiple unrelated processes, interval not applicable</li>
</ul>
</div>
<div id="outline-container-org5264eba" class="outline-4">
<h4 id="org5264eba"><span class="section-number-4">1.1.1.</span> Independent Parallelism</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
No explicit synchronization between processes, each represents a separate job.
Example is time-sharing system.
Works similar to multiprogrammed uniprocessor with shorter average response time.
</p>
</div>
</div>
<div id="outline-container-orgcbb9dce" class="outline-4">
<h4 id="orgcbb9dce"><span class="section-number-4">1.1.2.</span> Coarse and Very Coarse-Grained Parallelism</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Only high-level synchronization among processes so can work as concurrent processes
running on a multiprogrammed uniprocessor, so not much user code change.
</p>

<p>
Any collection of concurrent processes that need to communicate or synchronize can
benefit from multiprocessor use.
If infrequent process interaction, a distributed system could provide support,
if frequent, then overhead of network communication negates some speedup.
</p>
</div>
</div>
<div id="outline-container-org7017e5d" class="outline-4">
<h4 id="org7017e5d"><span class="section-number-4">1.1.3.</span> Medium-Grained Parallelism</h4>
<div class="outline-text-4" id="text-1-1-3">
<p>
If an application is a collection of threads in a process, the programmer must
specify potential parallelism.
Typically, much coordination and interaction among the threads of an application.
</p>

<p>
Since application threads interact frequently, scheduling decisions concerning 1
thread may affect application performance.
</p>
</div>
</div>
<div id="outline-container-org0b407e4" class="outline-4">
<h4 id="org0b407e4"><span class="section-number-4">1.1.4.</span> Fine-Grained Parallelism</h4>
<div class="outline-text-4" id="text-1-1-4">
<p>
More complex use of parallelism found in the use of threads.
Specialized and fragmented area.
</p>
</div>
</div>
</div>
<div id="outline-container-org3d1bfa8" class="outline-3">
<h3 id="org3d1bfa8"><span class="section-number-3">1.2.</span> Design Issues</h3>
<div class="outline-text-3" id="text-1-2">
<p>
3 interrelated issues for multiprocessor scheduling:
</p>
<ol class="org-ol">
<li>assignment of processes to processors</li>
<li>use of multiprogramming on individual processors</li>
<li>actual dispatching a process</li>
</ol>
</div>
