3A/SE350/Multiprocessor-Multicore-Realtime-Scheduling.tex
% Created 2024-04-07 Sun 22:49
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Multiprocessor, Multicore, and Realtime Scheduling}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Multiprocessor, Multicore, and Realtime Scheduling},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.3 (Org mode 9.7)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Multiprocessor and Multicore Scheduling}
\label{sec:org69940b3}
Multiprocessor systems can be classified as:
\begin{itemize}
\item \textbf{loosely coupled or distributed multiprocessor or cluster}: has collection of relatively
autonomous systems, each processor having its own main memory and IO channels
\item \textbf{functionaly specialized processors}: controlled by the master processor and provide services
to it
\item \textbf{tightly coupled multiprocessor}: has set of processors that share a common main memory and
are under the integrated control of an OS
\end{itemize}
\subsection{Granularity}
\label{sec:org0b3463b}
Multiprocessors can be categorized and placed in context with other architectures by
considering \textbf{synchronization granularity} or frequency between processes in a system.

Grain categories are:
\begin{itemize}
\item \textbf{fine}: parallelism inherent in a single instruction stream, interval <20 instructions
\item \textbf{medium}: parallel processing or multitasking within a single application, interval
20-200 instructions
\item \textbf{coarse}: multiprocessing of concurrent ptocesses in a multiprogramming environment,
interval 200-2000 instructions
\item \textbf{very coarse}: distributed processing across network nodes to form a single computing
environment, interval 2000-1 million instructions
\item \textbf{independent}: multiple unrelated processes, interval not applicable
\end{itemize}
\subsubsection{Independent Parallelism}
\label{sec:org797242c}
No explicit synchronization between processes, each represents a separate job.
Example is time-sharing system.
Works similar to multiprogrammed uniprocessor with shorter average response time.
\subsubsection{Coarse and Very Coarse-Grained Parallelism}
\label{sec:org8909b3c}
Only high-level synchronization among processes so can work as concurrent processes
running on a multiprogrammed uniprocessor, so not much user code change.

Any collection of concurrent processes that need to communicate or synchronize can
benefit from multiprocessor use.
If infrequent process interaction, a distributed system could provide support,
if frequent, then overhead of network communication negates some speedup.
\subsubsection{Medium-Grained Parallelism}
\label{sec:orgabdef84}
If an application is a collection of threads in a process, the programmer must
specify potential parallelism.
Typically, much coordination and interaction among the threads of an application.

Since application threads interact frequently, scheduling decisions concerning 1
thread may affect application performance.
\subsubsection{Fine-Grained Parallelism}
\label{sec:org884dde4}
More complex use of parallelism found in the use of threads.
Specialized and fragmented area.
\subsection{Design Issues}
\label{sec:org699926d}
3 interrelated issues for multiprocessor scheduling:
\begin{enumerate}
\item assignment of processes to processors
\item use of multiprogramming on individual processors
\item actual dispatching a process
\end{enumerate}
