3A/SE350/Multiprocessor-Multicore-Realtime-Scheduling.org
*** Assignment of Processes to Processors
Assume multiprocessor architecture is uniform and treat processors as a pooled
resource and assign processes to processors on demand.

With static assignment, a processor is permanently assinged to one processor from
activation to completion, so a dedicated short-term queue is maintained for each
processor.
Advantage is less overhead in scheduling since processor assignment is known,
allows for gang scheduling.
Disadvantage is uneven load (one processor empty, one has backlog). To fix this,
a global queue can be used.
Context info for all processes will be available to all processors and so the
cost of scheduling will be independent of the identity of the processor on which
it is scheduled.
Another option is dynamic load balancing, where threads are moved from a queue
for one processor to a queue for another processor.

Approaches to assign processes to processors are master/slave and peer.

With master/slave, kernel functions like scheduling are only on a particular
processor (master) and slaves run user programs and call master for service
calls (IO).
Conflict resolution simple since 1 processor has control of memory and IO resources.
Disadvantages are the danger of master failure and bottlenecks from the master.

With peer architecture, any processor can run kernel and each process self-schedules.
Must ensure processes aren't lost and 2 processors do not choose the same process.

*** Use of Multiprogramming on Individual Processes
When many processors are available, no need for every processor to be as busy as
possible but rather provide best average performance.

An application with many threads may run poorly unless all can run simultaneously.

*** Process Dispatching
For multiprocessors, priority or scheduling algorithms may have unnecessary overhead.
For thread scheduling, new issues are in play that may be more important than
priorities or execution histories.

** Process Scheduling
Most traditional multiprocessor systems have common pool of processors.

Result of speedup of scheduling algorithms depends on variability in service times,
measured with coefficient of variation $C_{s}$.
Larger $C_{s}$ means more variation.
With 2 processors, longer processes do not hold up FCFS too long.

Specific scheduling discipline is less important with 2+ processors than 1.
Simple FCFS (possible with priorities) may work for a multiprocessor system.

** Thread Scheduling
On a uniprocessor, threads help with program structure and overlapping IO with
processing.

In a multiprocessing environment, threads allow parallelism leading to dramatic gains
in performance. With medium-grained parallelism, small differences in thread
management and scheduling can have significant performance impact.

General approaches for multiprocessor thread scheduling and processor assignment:
1. *load sharing*: global queue of ready threads and each processor selects a thread
   from the queue when idle
2. *gang scheduling*: a set of related threads is scheduled to run on a set of
   processors at the same time on a 1:1 basis
3. *dedicated processor assignment*: threads assigned to processors such that each
   thread in a program gets one processor and when program terminates, all processors
   returned to general pool for allocation to another program
4. *dynamic scheduling*: number of threads in a process can be altered during execution

*** Load Sharing
Advantages:
- load distributed evenly across processors, no unnecessarily idle processor
- no centralized scheduler needed, scheduling run on available processors
- global queue organized and accessed using any scheduling policy

Versions of load sharing:
1. *FCFS*: when a job arrives, each thread placed consecutively at the end of the
   shared queue, idle processors pick the next ready thread
2. *smallest number of threads first*: shared ready queue is organized as a
   priority queue with highest priority given to threads from jobs with least
   unscheduled threads, if equal then arrival time used
3. *preemptive smallest number of threads first*: highest priority given to
   jobs with least unscheduled threads, and a new job with less threads than
   the current can preempt threads belonging to the scheduled job

FCFS is superior since gang scheduling better than load sharing.

Disadvantages of load sharing are:
- central queue has a region of memory that must enforce mutual exclusion,
  which could lead to a bottleneck and could be a problem if not enough
  processors
- preempted threads unlikely to resume execution on the same process, so
  caching less efficient
- unlikely all threads gain access to processors at the same time so much
  coordination required

