3A/SE350/Multiprocessor-Multicore-Realtime-Scheduling.html
<div id="outline-container-orgf029829" class="outline-4">
<h4 id="orgf029829"><span class="section-number-4">1.2.1.</span> Assignment of Processes to Processors</h4>
<div class="outline-text-4" id="text-1-2-1">
<p>
Assume multiprocessor architecture is uniform and treat processors as a pooled
resource and assign processes to processors on demand.
</p>

<p>
With static assignment, a processor is permanently assinged to one processor from
activation to completion, so a dedicated short-term queue is maintained for each
processor.
Advantage is less overhead in scheduling since processor assignment is known,
allows for gang scheduling.
Disadvantage is uneven load (one processor empty, one has backlog). To fix this,
a global queue can be used.
Context info for all processes will be available to all processors and so the
cost of scheduling will be independent of the identity of the processor on which
it is scheduled.
Another option is dynamic load balancing, where threads are moved from a queue
for one processor to a queue for another processor.
</p>

<p>
Approaches to assign processes to processors are master/slave and peer.
</p>

<p>
With master/slave, kernel functions like scheduling are only on a particular
processor (master) and slaves run user programs and call master for service
calls (IO).
Conflict resolution simple since 1 processor has control of memory and IO resources.
Disadvantages are the danger of master failure and bottlenecks from the master.
</p>

<p>
With peer architecture, any processor can run kernel and each process self-schedules.
Must ensure processes aren&rsquo;t lost and 2 processors do not choose the same process.
</p>
</div>
</div>
<div id="outline-container-orgfff7acc" class="outline-4">
<h4 id="orgfff7acc"><span class="section-number-4">1.2.2.</span> Use of Multiprogramming on Individual Processes</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
When many processors are available, no need for every processor to be as busy as
possible but rather provide best average performance.
</p>

<p>
An application with many threads may run poorly unless all can run simultaneously.
</p>
</div>
</div>
<div id="outline-container-orgb26d220" class="outline-4">
<h4 id="orgb26d220"><span class="section-number-4">1.2.3.</span> Process Dispatching</h4>
<div class="outline-text-4" id="text-1-2-3">
<p>
For multiprocessors, priority or scheduling algorithms may have unnecessary overhead.
For thread scheduling, new issues are in play that may be more important than
priorities or execution histories.
</p>
</div>
</div>
</div>
<div id="outline-container-org8d42be4" class="outline-3">
<h3 id="org8d42be4"><span class="section-number-3">1.3.</span> Process Scheduling</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Most traditional multiprocessor systems have common pool of processors.
</p>

<p>
Result of speedup of scheduling algorithms depends on variability in service times,
measured with coefficient of variation \(C_{s}\).
Larger \(C_{s}\) means more variation.
With 2 processors, longer processes do not hold up FCFS too long.
</p>

<p>
Specific scheduling discipline is less important with 2+ processors than 1.
Simple FCFS (possible with priorities) may work for a multiprocessor system.
</p>
</div>
</div>
<div id="outline-container-orge79e41a" class="outline-3">
<h3 id="orge79e41a"><span class="section-number-3">1.4.</span> Thread Scheduling</h3>
<div class="outline-text-3" id="text-1-4">
<p>
On a uniprocessor, threads help with program structure and overlapping IO with
processing.
</p>

<p>
In a multiprocessing environment, threads allow parallelism leading to dramatic gains
in performance. With medium-grained parallelism, small differences in thread
management and scheduling can have significant performance impact.
</p>

<p>
General approaches for multiprocessor thread scheduling and processor assignment:
</p>
<ol class="org-ol">
<li><b>load sharing</b>: global queue of ready threads and each processor selects a thread
from the queue when idle</li>
<li><b>gang scheduling</b>: a set of related threads is scheduled to run on a set of
processors at the same time on a 1:1 basis</li>
<li><b>dedicated processor assignment</b>: threads assigned to processors such that each
thread in a program gets one processor and when program terminates, all processors
returned to general pool for allocation to another program</li>
<li><b>dynamic scheduling</b>: number of threads in a process can be altered during execution</li>
</ol>
</div>
<div id="outline-container-org9b26996" class="outline-4">
<h4 id="org9b26996"><span class="section-number-4">1.4.1.</span> Load Sharing</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
Advantages:
</p>
<ul class="org-ul">
<li>load distributed evenly across processors, no unnecessarily idle processor</li>
<li>no centralized scheduler needed, scheduling run on available processors</li>
<li>global queue organized and accessed using any scheduling policy</li>
</ul>

<p>
Versions of load sharing:
</p>
<ol class="org-ol">
<li><b>FCFS</b>: when a job arrives, each thread placed consecutively at the end of the
shared queue, idle processors pick the next ready thread</li>
<li><b>smallest number of threads first</b>: shared ready queue is organized as a
priority queue with highest priority given to threads from jobs with least
unscheduled threads, if equal then arrival time used</li>
<li><b>preemptive smallest number of threads first</b>: highest priority given to
jobs with least unscheduled threads, and a new job with less threads than
the current can preempt threads belonging to the scheduled job</li>
</ol>

<p>
FCFS is superior since gang scheduling better than load sharing.
</p>

<p>
Disadvantages of load sharing are:
</p>
<ul class="org-ul">
<li>central queue has a region of memory that must enforce mutual exclusion,
which could lead to a bottleneck and could be a problem if not enough
processors</li>
<li>preempted threads unlikely to resume execution on the same process, so
caching less efficient</li>
<li>unlikely all threads gain access to processors at the same time so much
coordination required</li>
</ul>
</div>
</div>
