3A/SE350/Multiprocessor-Multicore-Realtime-Scheduling.html
<div id="outline-container-org19c5e3b" class="outline-4">
<h4 id="org19c5e3b"><span class="section-number-4">1.4.2.</span> Gang Scheduling</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
The concept of scheduling a set of processes simultaneously on a set of
processors.
</p>

<p>
Advantages:
</p>
<ul class="org-ul">
<li>if processes in the group are related or coordinated, synchronization blocking
could be reduced, less process switching, and better performance</li>
<li>single scheduling decision affects multiple processors and processes, so less
scheduling overhead</li>
</ul>

<p>
<b>Coscheduling</b>: scheduling a related set of tasks (task force) that are small
and close to the idea of a thread
</p>

<p>
Useful for medium and fine-grained applications where performance degrades
when any part of the application is not running while others are ready
to run.
</p>

<p>
Gang scheduling reduces process switches since all threads are in system
and saves time in resource allocation since process has IO access.
</p>

<p>
If there are several single-thread applications, they could all fit together
to increase processor utilization. Otherwise, scheduling could be weighted
by the number of threads.
</p>
</div>
</div>
<div id="outline-container-orga705d20" class="outline-4">
<h4 id="orga705d20"><span class="section-number-4">1.4.3.</span> Dedicated Processor Assignment</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
When an application is sceheduled, each thread is assigned a processor
that is dedicated to that thread until application completion.
</p>

<p>
Wastes time in the case of blocking for IO or synchronization.
Defence of this strategy:
</p>
<ol class="org-ol">
<li>in a highly parallel system, processor utilization is no longer an important
metric for effectiveness or performance</li>
<li>avoidance of process switching during program lifetime results in speedup</li>
</ol>

<p>
Performance degrades as both total number of processes exceepts number of
processors.
More threads means more thread preemption and rescheduling, which leads to
inefficiency from many sources.
Limit the number of active threads to the number of processors.
</p>

<p>
Activity working set is the minimum number of threads that must be scheduled
simultaneously on processors for the application to make acceptable progress.
Not scheduling activity working set could lead to processor thrashing.
</p>

<p>
<b>Processor thrashing</b>: when scheduling threads whose services are required
deschedules other threads whose services are soon needed
</p>

<p>
<b>Processor fragmentation</b>: situation in which some processors are left over
when others are allocated and leftovers have insufficient number or lack
organization to support waiting applications
</p>

<p>
Gang scheduling and dedicated processor allocation avoid these
</p>
</div>
</div>
<div id="outline-container-orgbfe8b3c" class="outline-4">
<h4 id="orgbfe8b3c"><span class="section-number-4">1.4.4.</span> Dynamic Scheduling</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
Number of threads in process can be altered dynamically, so OS can adjust
load to improve utilization.
</p>

<p>
OS partitions processors among jobs and each job executes subset of tasks by
mapping them to threads (subset decided by application).
</p>

<p>
Here, scheduling responsibility of OS is limited to processor allocation.
When a job requests 1+ processors (when job arrives for the 1st time or
requirements change):
</p>
<ol class="org-ol">
<li>use idle processors first to satisfy request</li>
<li>if the requesting job is new, allocate a single processor by taking it from
any job currently allocated 1+ processors</li>
<li>if any portion of the request cannot be satisfied, it remains outstanding
until a process becomes available or the job rescinds the request</li>
<li>when 1+ processors are released, scan the current queue for unsatisfied
requests and assign a single processor to each job in the list with no
processors, then scan again and allocate based on FCFS</li>
</ol>

<p>
Dynamic allocation superior to gang scheduling and dedicated processor assignment,
but overhead may negate performance advantage.
</p>
</div>
</div>
</div>
<div id="outline-container-orge43b6b8" class="outline-3">
<h3 id="orge43b6b8"><span class="section-number-3">1.5.</span> Multicore Thread Scheduling</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Some OSs treat multicore the same as multiprocessor systems (use load balancing).
</p>

<p>
More cores per chip means minimize access to off-chip memory (with cache and locality)
rather than maximize processor utilization.
This could be complex for caches shared by only some cores.
For this case, scheduling should assign threads that share memory resources to those
that share cache and vice versa for load balancing.
</p>

<p>
Two aspects of cache sharing:
</p>
<ul class="org-ul">
<li><b>cooperative resource sharing</b>: multiple threads access the same set of main memory
locations
<ul class="org-ul">
<li>data brought into a cache by one thread must be accessed by a cooperating thread,
so cooperating threads should be on adjacent cores (share cache)</li>
</ul></li>
<li><b>resource contention</b>: when threads compete for cache memory locations
<ul class="org-ul">
<li>if more cache is allocated to one thread, other thread(s) suffer performance
degradation</li>
<li>with contention-aware scheduling, allocate threads to cores to maximize
effectiveness of shared cache memory</li>
</ul></li>
</ul>
</div>
</div>
</div>
