3A/SE350/Multiprocessor-Multicore-Realtime-Scheduling.tex
\subsubsection{Gang Scheduling}
\label{sec:org7a99a7f}
The concept of scheduling a set of processes simultaneously on a set of
processors.

Advantages:
\begin{itemize}
\item if processes in the group are related or coordinated, synchronization blocking
could be reduced, less process switching, and better performance
\item single scheduling decision affects multiple processors and processes, so less
scheduling overhead
\end{itemize}

\textbf{Coscheduling}: scheduling a related set of tasks (task force) that are small
and close to the idea of a thread

Useful for medium and fine-grained applications where performance degrades
when any part of the application is not running while others are ready
to run.

Gang scheduling reduces process switches since all threads are in system
and saves time in resource allocation since process has IO access.

If there are several single-thread applications, they could all fit together
to increase processor utilization. Otherwise, scheduling could be weighted
by the number of threads.
\subsubsection{Dedicated Processor Assignment}
\label{sec:org8fa7513}
When an application is sceheduled, each thread is assigned a processor
that is dedicated to that thread until application completion.

Wastes time in the case of blocking for IO or synchronization.
Defence of this strategy:
\begin{enumerate}
\item in a highly parallel system, processor utilization is no longer an important
metric for effectiveness or performance
\item avoidance of process switching during program lifetime results in speedup
\end{enumerate}

Performance degrades as both total number of processes exceepts number of
processors.
More threads means more thread preemption and rescheduling, which leads to
inefficiency from many sources.
Limit the number of active threads to the number of processors.

Activity working set is the minimum number of threads that must be scheduled
simultaneously on processors for the application to make acceptable progress.
Not scheduling activity working set could lead to processor thrashing.

\textbf{Processor thrashing}: when scheduling threads whose services are required
deschedules other threads whose services are soon needed

\textbf{Processor fragmentation}: situation in which some processors are left over
when others are allocated and leftovers have insufficient number or lack
organization to support waiting applications

Gang scheduling and dedicated processor allocation avoid these
\subsubsection{Dynamic Scheduling}
\label{sec:org22974e8}
Number of threads in process can be altered dynamically, so OS can adjust
load to improve utilization.

OS partitions processors among jobs and each job executes subset of tasks by
mapping them to threads (subset decided by application).

Here, scheduling responsibility of OS is limited to processor allocation.
When a job requests 1+ processors (when job arrives for the 1st time or
requirements change):
\begin{enumerate}
\item use idle processors first to satisfy request
\item if the requesting job is new, allocate a single processor by taking it from
any job currently allocated 1+ processors
\item if any portion of the request cannot be satisfied, it remains outstanding
until a process becomes available or the job rescinds the request
\item when 1+ processors are released, scan the current queue for unsatisfied
requests and assign a single processor to each job in the list with no
processors, then scan again and allocate based on FCFS
\end{enumerate}

Dynamic allocation superior to gang scheduling and dedicated processor assignment,
but overhead may negate performance advantage.
\subsection{Multicore Thread Scheduling}
\label{sec:org7595825}
Some OSs treat multicore the same as multiprocessor systems (use load balancing).

More cores per chip means minimize access to off-chip memory (with cache and locality)
rather than maximize processor utilization.
This could be complex for caches shared by only some cores.
For this case, scheduling should assign threads that share memory resources to those
that share cache and vice versa for load balancing.

Two aspects of cache sharing:
\begin{itemize}
\item \textbf{cooperative resource sharing}: multiple threads access the same set of main memory
locations
\begin{itemize}
\item data brought into a cache by one thread must be accessed by a cooperating thread,
so cooperating threads should be on adjacent cores (share cache)
\end{itemize}
\item \textbf{resource contention}: when threads compete for cache memory locations
\begin{itemize}
\item if more cache is allocated to one thread, other thread(s) suffer performance
degradation
\item with contention-aware scheduling, allocate threads to cores to maximize
effectiveness of shared cache memory
\end{itemize}
\end{itemize}
