3A/SE350/Multiprocessor-Multicore-Realtime-Scheduling.html
<div id="outline-container-org7d4910d" class="outline-2">
<h2 id="org7d4910d"><span class="section-number-2">2.</span> Real-Time Scheduling</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org049ddf8" class="outline-3">
<h3 id="org049ddf8"><span class="section-number-3">2.1.</span> Background</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<b>Real-time computing</b>: computing where system correctness depends on logical results and time when
results are produced
</p>

<p>
Real-time tasks attempt to control or react to events in the outside world, with which it must keep up.
</p>

<p>
<b>Hard real-time task</b> must meet its deadline or cause unacceptable damage or fatal error to the system
</p>

<p>
<b>Soft real-time task</b> has an associated deadline that is desirable but not mandatory, can still be
scheduled and completed after its deadline
</p>

<p>
<b>Aperiodic task</b> has a deadline by which it must finish or start or may have a constraint on
start and finish time
</p>

<p>
<b>Periodic task</b> has a requirement every \(T\) units apart
</p>
</div>
</div>
<div id="outline-container-org974bab4" class="outline-3">
<h3 id="org974bab4"><span class="section-number-3">2.2.</span> Characteristics of Real-Time Operating Systems</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Have unique requirements in the areas of determinism, responsiveness, user control, reliability,
and fail-soft operation.
</p>

<p>
An OS is <b>deterministic</b> based on the extent it performs operations at fixed, predetermined times
or within predetermined time intervals.
Impossible when processes compete for resources and in an RTOS, process requests for service are
dictated by external events and timings.
Determinism depends on interrupt response speed and request capacity per time.
One measure of determinism is delay from high priority interrupt to service.
</p>

<p>
<b>Responsiveness</b> is concerned with how long after acknowledgement it takes an OS to service the
interrupt.
Aspects include:
</p>
<ol class="org-ol">
<li>amount of time required to handle the interrupt and begin execution of the interrupt service
routine (ISR), if this requires a process switch then longer delay</li>
<li>amount of time to perform ISR, depends on hardware</li>
<li>effect of interrupt nesting, service delayed if ISR can be interrupted</li>
</ol>

<p>
<b>User control</b> is essential in real-time systems to allow users fine-grained control over task priority.
User should be able to distinguish between hard and soft tasks and specify relative priorities for each.
Real-time systems allow the user to specify memory use as well (paging, swapping, resident set, etc).
</p>

<p>
<b>Reliability</b> is important since real-time systems respond to and control events in real time.
Performance degradation may have catastrophic consequences.
</p>

<p>
<b>Fail-soft operation</b>: the ability of a system to fail in such a way as to preserve capability and data.
</p>

<p>
Real-time systems will not simply fail but attempt to correct or minimize effect of failure and continue
to run.
User is notified of corrective action and reduced level of service. If shutdown, data consistency
maintained.
</p>

<p>
A real-time system is stable if the system at least meets the deadlines of its most critical, highest-priority tasks.
</p>

<p>
Important features for real-time OSs:
</p>
<ul class="org-ul">
<li>a stricter use of priorities with preemptive scheduling designed to meet real-time requirements</li>
<li>interrupt latency (time between generation and servicing) bounded and relatively short</li>
<li>precise and predictable timing characteristics</li>
</ul>

<p>
Design short-term scheduler so that all hard real-time tasks complete (or start) by their deadline and as many as possible
soft real-time tasks complete (or start) by their deadline.
Most RTOSs are designed to be as responsive as possible to real-time tasks so when a deadline approaches, a task can be
quickly scheduled.
</p>

<p>
Nonpreemptive or preemptive scheduling without priorities does not work for real-time.
Priority preemptive scheduling or immediate preemption could be used instead.
</p>
</div>
</div>
