3A/SE350/Multiprocessor-Multicore-Realtime-Scheduling.tex
\section{Real-Time Scheduling}
\label{sec:org9b383f7}
\subsection{Background}
\label{sec:org1540f2b}
\textbf{Real-time computing}: computing where system correctness depends on logical results and time when
results are produced

Real-time tasks attempt to control or react to events in the outside world, with which it must keep up.

\textbf{Hard real-time task} must meet its deadline or cause unacceptable damage or fatal error to the system

\textbf{Soft real-time task} has an associated deadline that is desirable but not mandatory, can still be
scheduled and completed after its deadline

\textbf{Aperiodic task} has a deadline by which it must finish or start or may have a constraint on
start and finish time

\textbf{Periodic task} has a requirement every \(T\) units apart
\subsection{Characteristics of Real-Time Operating Systems}
\label{sec:org4c48af7}
Have unique requirements in the areas of determinism, responsiveness, user control, reliability,
and fail-soft operation.

An OS is \textbf{deterministic} based on the extent it performs operations at fixed, predetermined times
or within predetermined time intervals.
Impossible when processes compete for resources and in an RTOS, process requests for service are
dictated by external events and timings.
Determinism depends on interrupt response speed and request capacity per time.
One measure of determinism is delay from high priority interrupt to service.

\textbf{Responsiveness} is concerned with how long after acknowledgement it takes an OS to service the
interrupt.
Aspects include:
\begin{enumerate}
\item amount of time required to handle the interrupt and begin execution of the interrupt service
routine (ISR), if this requires a process switch then longer delay
\item amount of time to perform ISR, depends on hardware
\item effect of interrupt nesting, service delayed if ISR can be interrupted
\end{enumerate}

\textbf{User control} is essential in real-time systems to allow users fine-grained control over task priority.
User should be able to distinguish between hard and soft tasks and specify relative priorities for each.
Real-time systems allow the user to specify memory use as well (paging, swapping, resident set, etc).

\textbf{Reliability} is important since real-time systems respond to and control events in real time.
Performance degradation may have catastrophic consequences.

\textbf{Fail-soft operation}: the ability of a system to fail in such a way as to preserve capability and data.

Real-time systems will not simply fail but attempt to correct or minimize effect of failure and continue
to run.
User is notified of corrective action and reduced level of service. If shutdown, data consistency
maintained.

A real-time system is stable if the system at least meets the deadlines of its most critical, highest-priority tasks.

Important features for real-time OSs:
\begin{itemize}
\item a stricter use of priorities with preemptive scheduling designed to meet real-time requirements
\item interrupt latency (time between generation and servicing) bounded and relatively short
\item precise and predictable timing characteristics
\end{itemize}

Design short-term scheduler so that all hard real-time tasks complete (or start) by their deadline and as many as possible
soft real-time tasks complete (or start) by their deadline.
Most RTOSs are designed to be as responsive as possible to real-time tasks so when a deadline approaches, a task can be
quickly scheduled.

Nonpreemptive or preemptive scheduling without priorities does not work for real-time.
Priority preemptive scheduling or immediate preemption could be used instead.
