3A/SE350/Multiprocessor-Multicore-Realtime-Scheduling.org
** Real-Time Scheduling
Scheduling approaches depend on
1. whether a system performs schedulability analysis
2. if it does, whether it is done statically or dynamically
3. whether the result of analysis produces a schedule or plan according to which tasks are dispatched at runtime

Classes of algorithms:
- *static table-driven approaches* perform a static analysis of feasible schedules of dispatching, result is a schedule
  that determines at runtime when a task must begin execution
  - used for periodic tasks given periodic arrival time, execution time, periodic deadline, and relative priority
  - predictable and inflexible since changes require new schedule
- *static priority-driven preemptive approaches* perform a static analysis but no schedule, instead assign priorities to
  tasks with a traditional priority-driven preemptive scheduler
  - priority related to time constraints
- *dynamic planning-based approaches* determine feasibility at runtime rather than statically, arriving task executed only if
  feasible to meet time constraints, result is schedule or plan on when to dispatch task
- *dynamic best effort approaches* have no feasibility analysis and try to meet all deadlines and abort processes whose deadline
  is missed
  - on arrival, a task gets a priority
  - tasks are aperiodic so no static scheduling analysis
  - unknown if deadline will be met until deadline arrives or task complete

** Deadline Scheduling
Real-time applications are not concerned with speed but rather completing tasks at the right time despite dynamic resource
demands and conflicts, processing overloads, and hardware or software faults.

Useful info about tasks:
- *ready time*: when task becomes ready for execution, known for period and some aperiodic tasks
- *starting deadline*: time by which a task must begin
- *completion deadline*: time by which a task must be completed
- *processing time*: time required to execute task to completion
- *resource requirements*: set of resources (other than processor) required by the task
- *priority*: relative importance of task, hard real-time tasks could have absolute priority and system failure is missed
- *subtask structure*: a task may be decomposed into a mandatory subtask (with hard deadline) and optional subtask

A policy of scheduling the task with the earliest deadline minimizes the fraction of tasks that miss their deadlines.
When start deadlines are specified, use nonpreemptive scheduler (task blocks itself).
When completion deadlines are specifies, use preemptive scheduler (OS preempts).

Straightforward scheme is to always schedule the ready task with earliest deadline and let it run to completion.
For aperiodic tasks, this could lead to missed deadlines.
Instead, earliest deadline with unforced idle times could be used where the task with the earliest deadline is scheduled
and run to completion, even if processor is idle.

** Rate Monotonic Scheduling
Assigns priorities to tasks on the basis of their periods, highest priority is shortest period.

Period $T$ is the amount of time between arrival of one instance of the task and arrival of the next instance of the task.
Rate is the inverse of period.
Execution time $C$ is the amount of processing time required for each occurrence where $C \le T$ for uniprocessor.
If task never denied service, then processor utilization by task is $U = C/T$.

To check if all hard deadlines are met, for $n$ tasks to meet all deadlines, the following must hold (for a perfect
scheduling algorithm):
$$
\frac{C_{1}}{T_{1}} + \frac{C_{2}}{T_{2}} + \cdots + \frac{C_{n}}{T_{n}} \le 1
$$
For RMS, this is
$$
\frac{C_{1}}{T_{1}} + \frac{C_{2}}{T_{2}} + \cdots + \frac{C_{n}}{T_{n}} \le n(2^{1/n} - 1)
$$
which converges to $\ln(2) \approx 0.693$ for infinite tasks.
If total utilization is less than this bound, then all tasks will be successfully scheduled.

For earliest-deadline scheduling, upper bound is 1, so more processor utilization and more periodic tasks accommodated.

Benefits of RMS:
1. performance difference is small in practice, as 0.693 is conservative
2. most hard real-time systems have soft real-time components that can execute at lower-priorities when not running
   RMS scheduling for hard real-time tasks
3. RMS more stable, since essential tasks must have deadlines guaranteed if schedulable, which can be done in RMS by
   giving them short periods or modifying RMS priorities to account for essential tasks
   a. with earliest deadline, a periodic task's priority changes every period so less guarantees

