3A/SE350/Multiprocessor-Multicore-Realtime-Scheduling.html
<div id="outline-container-orgf0bd5e3" class="outline-3">
<h3 id="orgf0bd5e3"><span class="section-number-3">2.3.</span> Real-Time Scheduling</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Scheduling approaches depend on
</p>
<ol class="org-ol">
<li>whether a system performs schedulability analysis</li>
<li>if it does, whether it is done statically or dynamically</li>
<li>whether the result of analysis produces a schedule or plan according to which tasks are dispatched at runtime</li>
</ol>

<p>
Classes of algorithms:
</p>
<ul class="org-ul">
<li><b>static table-driven approaches</b> perform a static analysis of feasible schedules of dispatching, result is a schedule
that determines at runtime when a task must begin execution
<ul class="org-ul">
<li>used for periodic tasks given periodic arrival time, execution time, periodic deadline, and relative priority</li>
<li>predictable and inflexible since changes require new schedule</li>
</ul></li>
<li><b>static priority-driven preemptive approaches</b> perform a static analysis but no schedule, instead assign priorities to
tasks with a traditional priority-driven preemptive scheduler
<ul class="org-ul">
<li>priority related to time constraints</li>
</ul></li>
<li><b>dynamic planning-based approaches</b> determine feasibility at runtime rather than statically, arriving task executed only if
feasible to meet time constraints, result is schedule or plan on when to dispatch task</li>
<li><b>dynamic best effort approaches</b> have no feasibility analysis and try to meet all deadlines and abort processes whose deadline
is missed
<ul class="org-ul">
<li>on arrival, a task gets a priority</li>
<li>tasks are aperiodic so no static scheduling analysis</li>
<li>unknown if deadline will be met until deadline arrives or task complete</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org95a3100" class="outline-3">
<h3 id="org95a3100"><span class="section-number-3">2.4.</span> Deadline Scheduling</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Real-time applications are not concerned with speed but rather completing tasks at the right time despite dynamic resource
demands and conflicts, processing overloads, and hardware or software faults.
</p>

<p>
Useful info about tasks:
</p>
<ul class="org-ul">
<li><b>ready time</b>: when task becomes ready for execution, known for period and some aperiodic tasks</li>
<li><b>starting deadline</b>: time by which a task must begin</li>
<li><b>completion deadline</b>: time by which a task must be completed</li>
<li><b>processing time</b>: time required to execute task to completion</li>
<li><b>resource requirements</b>: set of resources (other than processor) required by the task</li>
<li><b>priority</b>: relative importance of task, hard real-time tasks could have absolute priority and system failure is missed</li>
<li><b>subtask structure</b>: a task may be decomposed into a mandatory subtask (with hard deadline) and optional subtask</li>
</ul>

<p>
A policy of scheduling the task with the earliest deadline minimizes the fraction of tasks that miss their deadlines.
When start deadlines are specified, use nonpreemptive scheduler (task blocks itself).
When completion deadlines are specifies, use preemptive scheduler (OS preempts).
</p>

<p>
Straightforward scheme is to always schedule the ready task with earliest deadline and let it run to completion.
For aperiodic tasks, this could lead to missed deadlines.
Instead, earliest deadline with unforced idle times could be used where the task with the earliest deadline is scheduled
and run to completion, even if processor is idle.
</p>
</div>
</div>
<div id="outline-container-orgc22aa4f" class="outline-3">
<h3 id="orgc22aa4f"><span class="section-number-3">2.5.</span> Rate Monotonic Scheduling</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Assigns priorities to tasks on the basis of their periods, highest priority is shortest period.
</p>

<p>
Period \(T\) is the amount of time between arrival of one instance of the task and arrival of the next instance of the task.
Rate is the inverse of period.
Execution time \(C\) is the amount of processing time required for each occurrence where \(C \le T\) for uniprocessor.
If task never denied service, then processor utilization by task is \(U = C/T\).
</p>

<p>
To check if all hard deadlines are met, for \(n\) tasks to meet all deadlines, the following must hold (for a perfect
scheduling algorithm):
\[
\frac{C_{1}}{T_{1}} + \frac{C_{2}}{T_{2}} + \cdots + \frac{C_{n}}{T_{n}} \le 1
\]
For RMS, this is
\[
\frac{C_{1}}{T_{1}} + \frac{C_{2}}{T_{2}} + \cdots + \frac{C_{n}}{T_{n}} \le n(2^{1/n} - 1)
\]
which converges to \(\ln(2) \approx 0.693\) for infinite tasks.
If total utilization is less than this bound, then all tasks will be successfully scheduled.
</p>

<p>
For earliest-deadline scheduling, upper bound is 1, so more processor utilization and more periodic tasks accommodated.
</p>

<p>
Benefits of RMS:
</p>
<ol class="org-ol">
<li>performance difference is small in practice, as 0.693 is conservative</li>
<li>most hard real-time systems have soft real-time components that can execute at lower-priorities when not running
RMS scheduling for hard real-time tasks</li>
<li>RMS more stable, since essential tasks must have deadlines guaranteed if schedulable, which can be done in RMS by
giving them short periods or modifying RMS priorities to account for essential tasks
<ol class="org-ol">
<li>with earliest deadline, a periodic task&rsquo;s priority changes every period so less guarantees</li>
</ol></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-03-26 Tue 20:29</p>
</div>
</body>
</html>
