3A/SE350/Multiprocessor-Multicore-Realtime-Scheduling.tex
\subsection{Priority Inversion}
\label{sec:org9d0dd6f}
\textbf{Priority inversion} occurs when circumstances within the system force a higher-priority task to wait for
a lower-priority task.
\begin{itemize}
\item could occur if a higher-priority task attempts to lock a resource a lower-priority task already has
\end{itemize}

\textbf{Unbounded priority inversion}: when the duration of a priority inversion depends not only on the
time required to handle a shared resource but also on the unpredictable actions of other
unrelated tasks.
\subsubsection{Priority Inheritance}
\label{sec:org77cc164}
A lower-priority task inherits the priority of any higher-priority task pending on a shared resource.

The priority change occurs as soon as the higher-priority task blocks on the resource, ends when
the resource is released by the lower-priority task.
\subsubsection{Priority Ceiling}
\label{sec:org246135c}
A priority is associated with each resource, where the priority assigned to a resource is 1 level
higher than the priority of its highest-priority user.

The scheduler dynamically assigns this priority to any task that accesses that resource, and when
the task finishes with the resource, priority returns to normal.
\end{document}
